app/controllers/funcionarios_controller.rb

  def index
    @funcionarios = Funcionario.all
---
SELECT "funcionarios".* FROM "funcionarios"

  def show
    @funcionario = Funcionario.find(params[:id])
---
SELECT  "funcionarios".* FROM "funcionarios" WHERE "funcionarios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @funcionario = Funcionario.new(funcionario_params)
    if @funcionario.save
---
INSERT INTO "funcionarios" ("cpf", "nome", "telefone", "endereco", "cargo", "horario", "sexo", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @funcionario = Funcionario.find(params[:id])
---
SELECT  "funcionarios".* FROM "funcionarios" WHERE "funcionarios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]