app/controllers/pecas_controller.rb

  def index
    @pecas = Peca.all
---
SELECT "pecas".* FROM "pecas"

  def create
    @peca = Peca.new(peca_params)
    if @peca.save
---
INSERT INTO "pecas" ("codigo", "nome", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["codigo", 123], ["nome", "Qualquer Motor"], ["created_at", 2016-10-18 04:22:20 UTC], ["updated_at", 2016-10-18 04:22:20 UTC]]