app/controllers/sessions_controller.rb

SELECT  "funcionarios".* FROM "funcionarios" WHERE "funcionarios"."cpf" = ? LIMIT ?  [["cpf", 50], ["LIMIT", 1]]
---
  def create
    funcionario = Funcionario.find_by(cpf: params[:session][:cpf])